# PhyMaterialParamShearMod2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamShearMod2 Property
ParameterTypeId Class See Also
---
"Shear modulus Y"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamShearMod2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamShearMod2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamShearMod2 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace